sample/hashi/1bench-multiparam/nomad-sn-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d60-R500
Using argument nginx
using  args: threads=4 and connections=512 and duration=60 and requests=500
Running 1m test @ http://10.10.1.4:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.102ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.189ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.041ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.02ms    0.88ms   3.37ms   89.63%
    Req/Sec   131.59    117.88   444.00     58.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  793.00us
 75.000%    1.01ms
 90.000%    2.18ms
 99.000%    3.37ms
 99.900%   16.59ms
 99.990%   18.13ms
 99.999%   18.21ms
100.000%   18.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.331     0.000000            1         1.00
       0.505     0.100000         2489         1.11
       0.583     0.200000         4987         1.25
       0.658     0.300000         7500         1.43
       0.725     0.400000         9972         1.67
       0.793     0.500000        12466         2.00
       0.828     0.550000        13708         2.22
       0.865     0.600000        14956         2.50
       0.905     0.650000        16196         2.86
       0.951     0.700000        17421         3.33
       1.008     0.750000        18669         4.00
       1.044     0.775000        19286         4.44
       1.092     0.800000        19916         5.00
       1.152     0.825000        20536         5.71
       1.230     0.850000        21157         6.67
       1.354     0.875000        21774         8.00
       1.474     0.887500        22086         8.89
       2.185     0.900000        22397        10.00
       2.443     0.912500        22707        11.43
       2.607     0.925000        23021        13.33
       2.739     0.937500        23332        16.00
       2.799     0.943750        23493        17.78
       2.851     0.950000        23642        20.00
       2.915     0.956250        23800        22.86
       2.977     0.962500        23952        26.67
       3.043     0.968750        24112        32.00
       3.081     0.971875        24189        35.56
       3.115     0.975000        24266        40.00
       3.155     0.978125        24340        45.71
       3.203     0.981250        24420        53.33
       3.247     0.984375        24497        64.00
       3.279     0.985938        24542        71.11
       3.307     0.987500        24573        80.00
       3.345     0.989062        24614        91.43
       3.395     0.990625        24651       106.67
       3.451     0.992188        24690       128.00
       3.481     0.992969        24710       142.22
       3.519     0.993750        24729       160.00
       3.579     0.994531        24749       182.86
       3.627     0.995313        24768       213.33
       3.721     0.996094        24787       256.00
       3.755     0.996484        24797       284.44
       3.803     0.996875        24807       320.00
       3.859     0.997266        24816       365.71
       3.921     0.997656        24826       426.67
       4.013     0.998047        24836       512.00
       4.143     0.998242        24841       568.89
       4.191     0.998437        24846       640.00
       4.387     0.998633        24850       731.43
      15.975     0.998828        24855       853.33
      16.751     0.999023        24860      1024.00
      16.911     0.999121        24863      1137.78
      17.007     0.999219        24865      1280.00
      17.039     0.999316        24868      1462.86
      17.167     0.999414        24870      1706.67
      17.215     0.999512        24872      2048.00
      17.247     0.999561        24874      2275.56
      17.295     0.999609        24875      2560.00
      17.327     0.999658        24876      2925.71
      17.359     0.999707        24877      3413.33
      17.391     0.999756        24878      4096.00
      17.743     0.999780        24879      4551.11
      17.759     0.999805        24880      5120.00
      17.759     0.999829        24880      5851.43
      17.967     0.999854        24881      6826.67
      17.967     0.999878        24881      8192.00
      18.127     0.999890        24883      9102.22
      18.127     0.999902        24883     10240.00
      18.127     0.999915        24883     11702.86
      18.127     0.999927        24883     13653.33
      18.127     0.999939        24883     16384.00
      18.127     0.999945        24883     18204.44
      18.127     0.999951        24883     20480.00
      18.127     0.999957        24883     23405.71
      18.207     0.999963        24884     27306.67
      18.207     1.000000        24884          inf
#[Mean    =        1.016, StdDeviation   =        0.882]
#[Max     =       18.192, Total count    =        24884]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29800 requests in 1.00m, 5.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 2073
Requests/sec:    496.63
Transfer/sec:     97.31KB