sample/hashi/1bench-multiparam/nomad-sn-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-t4-c512-d30-R1500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=1500
Running 30s test @ http://10.10.1.4:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 0.903ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.912ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.919ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.880ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     0.88ms  664.45us   2.63ms   89.50%
    Req/Sec   392.41    202.91     0.90k    70.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  707.00us
 75.000%    0.97ms
 90.000%    1.68ms
 99.000%    2.63ms
 99.900%    3.37ms
 99.990%   16.53ms
 99.999%   17.25ms
100.000%   17.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.309     0.000000            1         1.00
       0.460     0.100000         3003         1.11
       0.507     0.200000         5958         1.25
       0.559     0.300000         8909         1.43
       0.621     0.400000        11857         1.67
       0.707     0.500000        14834         2.00
       0.760     0.550000        16317         2.22
       0.809     0.600000        17783         2.50
       0.856     0.650000        19271         2.86
       0.910     0.700000        20754         3.33
       0.972     0.750000        22222         4.00
       1.010     0.775000        22962         4.44
       1.052     0.800000        23701         5.00
       1.108     0.825000        24437         5.71
       1.180     0.850000        25180         6.67
       1.301     0.875000        25919         8.00
       1.406     0.887500        26286         8.89
       1.683     0.900000        26657        10.00
       1.862     0.912500        27026        11.43
       1.962     0.925000        27396        13.33
       2.059     0.937500        27772        16.00
       2.109     0.943750        27957        17.78
       2.159     0.950000        28143        20.00
       2.209     0.956250        28327        22.86
       2.257     0.962500        28508        26.67
       2.327     0.968750        28699        32.00
       2.355     0.971875        28791        35.56
       2.395     0.975000        28880        40.00
       2.429     0.978125        28970        45.71
       2.463     0.981250        29063        53.33
       2.515     0.984375        29162        64.00
       2.541     0.985938        29203        71.11
       2.569     0.987500        29249        80.00
       2.613     0.989062        29295        91.43
       2.653     0.990625        29344       106.67
       2.705     0.992188        29386       128.00
       2.721     0.992969        29409       142.22
       2.741     0.993750        29432       160.00
       2.771     0.994531        29456       182.86
       2.807     0.995313        29479       213.33
       2.843     0.996094        29502       256.00
       2.871     0.996484        29513       284.44
       2.911     0.996875        29525       320.00
       2.953     0.997266        29537       365.71
       3.001     0.997656        29548       426.67
       3.077     0.998047        29560       512.00
       3.097     0.998242        29565       568.89
       3.121     0.998437        29571       640.00
       3.155     0.998633        29577       731.43
       3.229     0.998828        29583       853.33
       3.527     0.999023        29589      1024.00
       3.639     0.999121        29591      1137.78
      10.655     0.999219        29594      1280.00
      15.599     0.999316        29597      1462.86
      15.887     0.999414        29600      1706.67
      15.959     0.999512        29603      2048.00
      15.967     0.999561        29604      2275.56
      15.991     0.999609        29606      2560.00
      16.015     0.999658        29607      2925.71
      16.119     0.999707        29609      3413.33
      16.167     0.999756        29610      4096.00
      16.207     0.999780        29611      4551.11
      16.223     0.999805        29612      5120.00
      16.223     0.999829        29612      5851.43
      16.279     0.999854        29613      6826.67
      16.527     0.999878        29614      8192.00
      16.527     0.999890        29614      9102.22
      16.895     0.999902        29615     10240.00
      16.895     0.999915        29615     11702.86
      16.895     0.999927        29615     13653.33
      17.039     0.999939        29616     16384.00
      17.039     0.999945        29616     18204.44
      17.039     0.999951        29616     20480.00
      17.039     0.999957        29616     23405.71
      17.039     0.999963        29616     27306.67
      17.247     0.999969        29617     32768.00
      17.247     1.000000        29617          inf
#[Mean    =        0.881, StdDeviation   =        0.664]
#[Max     =       17.232, Total count    =        29617]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44334 requests in 30.01s, 8.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 23
Requests/sec:   1477.44
Transfer/sec:    289.44KB